In [ ]:
"""
Class 05: Pandas Methods

Objectives:
- how to use panda methods to manipulate data
- how to custom dataframe methods

- We will count categorial variables and plot them
- We will group dataframe by coulumns
- We will earn to use pivot table for data analysis

"""

In [8]:
import pandas as pd
pd.__version__

ModuleNotFoundError: No module named 'pandas'

In [26]:
import pandas as pd
pd.__version__
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'age': [24, 30, 22, 35, 28, 40],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia'],
    'salary': [70000, 80000, 60000, 90000, 75000, 85000],
}

df = pd.DataFrame(data)
print(df)

      name  age          city  salary
0    Alice   24      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   22       Chicago   60000
3    David   35       Houston   90000
4      Eve   28       Phoenix   75000
5    Frank   40  Philadelphia   85000

In [10]:
df.head(3)

      name  age         city  salary
0    Alice   24     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   22      Chicago   60000

In [12]:
df.tail(3)

    name  age          city  salary
3  David   35       Houston   90000
4    Eve   28       Phoenix   75000
5  Frank   40  Philadelphia   85000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   city    6 non-null      object
 3   salary  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [14]:
df.describe()

             age        salary
count   6.000000      6.000000
mean   29.833333  76666.666667
std     6.765107  10801.234497
min    22.000000  60000.000000
25%    25.000000  71250.000000
50%    29.000000  77500.000000
75%    33.750000  83750.000000
max    40.000000  90000.000000

In [15]:
df.columns

Index(['name', 'age', 'city', 'salary'], dtype='object')

In [16]:
df.shape

(6, 4)

In [17]:
df.salary

0    70000
1    80000
2    60000
3    90000
4    75000
5    85000
Name: salary, dtype: int64

In [19]:
df['salary'].mean()

np.float64(76666.66666666667)

In [21]:
df[df['salary'] > 80000]

    name  age          city  salary
3  David   35       Houston   90000
5  Frank   40  Philadelphia   85000

In [27]:
df.isnull().sum()

name      0
age       0
city      0
salary    0
dtype: int64

In [28]:
df.fillna(0)

      name  age          city  salary
0    Alice   24      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   22       Chicago   60000
3    David   35       Houston   90000
4      Eve   28       Phoenix   75000
5    Frank   40  Philadelphia   85000

In [30]:
df.sort_values(by='age')

      name  age          city  salary
2  Charlie   22       Chicago   60000
0    Alice   24      New York   70000
4      Eve   28       Phoenix   75000
1      Bob   30   Los Angeles   80000
3    David   35       Houston   90000
5    Frank   40  Philadelphia   85000